
package com.hnradio.project.common.domain;


/**
 * 异常编码 0成功、-1熔断、 -2 标准参数校验不通过 -3会话超时
 * 前两位:服务标识
 * 中间两位:模块标识
 * 后两位:异常标识
 */
public enum ErrorCode {
	
	////////////////////////////////////公用异常编码 //////////////////////////
	/**
	 * 传入参数与接口不匹配
	 */
	E_100101(100101,"传入参数与接口不匹配"),
	/**
	 * 验证码错误
	 */
	E_100102(100102,"验证码错误"),
	/**
	 * 验证码为空
	 */
	E_100103(100103,"验证码为空"),
	/**
     * 查询结果为空
     */
    E_100104(100104,"查询结果为空"),
    /**
     * ID格式不正确或超出Long存储范围
     */
    E_100105(100105,"ID格式不正确或超出Long存储范围"),
    
	
	////////////////////////////////////资源服务异常编码//////////////////////////
	E_110101(110101,"用户不存在"),
	E_110102(110102,"验证码错误"),
	/**
	 * 应用名称为空
	 */
	E_110103(110103,"应用名称为空"),
	/**
     * 应用编码为空
     */
    E_110104(110104,"应用编码为空"),
    /**
     * 页码参数错误
     */
    E_110105(110105,"页码参数错误"),
    /**
     * 查询结果为空
     */
    E_110106(110106,"查询结果为空"),
    /**
     * 权限编码为空
     */
    E_110107(110107,"权限编码为空"),
    
    
    /**
     * 菜单标题为空
     */
    E_110108(110108,"菜单标题为空"),
    /**
     * ID为空
     */
    E_110109(110109,"ID为空"),
    /**
     * 请先删除子菜单再操作
     */
    E_110110(110110,"请先删除子菜单再操作"),
    /**
     * 编码已经存在
     */
    E_110111(110111,"编码已经存在"),
    /**
     * 请删除与此应用关联的菜单再操作
     */
    E_110112(110112,"请删除与此应用关联的菜单再操作"),
    /**
     * 菜单排序值为空
     */
    E_110113(110113,"菜单排序值为空"),
    /**
     * 应用编码为空
     */
    E_110114(110114,"应用编码为空"),
    /**
     * 菜单排序字段值应介于（1-20）
     */
    E_110115(110115,"菜单排序字段值应介于（1-20）"),
    /**
     * 菜单编码只能由“数字、字母、中划线”组成
     */
    E_110116(110116,"菜单编码只能由“数字、字母、中划线”组成"),
    /**
     * 编码对应的应用不存在
     */
    E_110117(110117,"编码对应的应用不存在"),
    /**
     * 菜单不存在
     */
    E_110118(110118,"菜单不存在"),
    /**
     * 应用名称已存在
     */
    E_110119(110119,"应用名称已存在"),


    ////////////////////////////////////授权服务异常编码 //////////////////////////
	/**
	 * 密码为空
	 */
	E_120101(120101,"密码为空"),
	/**
	 * 调用资源服务出错
	 */
	E_120102(120102,"调用资源服务出错"),
	/**
	 * ID 或 权限组名称 为空
	 */
	E_120103(120103,"ID 或 权限组名称 为空"),
	/**
     * 传入ID为空
     */
    E_120104(120104,"传入ID为空"),
    /**
     * 权限组不存在
     */
    E_120105(120105,"权限组不存在"),
    /**
     * 权限组为空
     */
    E_120106(120106,"权限组为空"),
    /**
     * 所属权限组id 或 权限编码 或 权限名称为空
     */
    E_120107(120107,"所属权限组id 或 权限编码 或 权限名称为空"),
    /**
     * 权限编码已经存在
     */
    E_120108(120108,"权限编码已经存在"),
    /**
     * 传入权限编码为空
     */
    E_120109(120109,"传入权限编码为空"),
    /**
     * 权限不存在
     */
    E_120110(120110,"权限不存在"),
    /**
     * 所属权限组id 或 权限编码 或 权限名称 为空
     */
    E_120111(120111,"所属权限组id 或 权限编码 或 权限名称 为空"),
    /**
     * 传入权限编码列表为空
     */
    E_120112(120112,"传入权限编码列表为空"),
    /**
     * 未查询到符合条件的内容
     */
    E_120113(120113,"未查询到符合条件的内容"),
    /**
     * 页码不能小于1
     */
    E_120114(120114,"页码不能小于1"),
    /**
     * 每页记录数不能小于1
     */
    E_120115(120115,"每页记录数不能小于1"),
    /**
     * 角色编码为空
     */
    E_120116(120116,"角色编码为空"),
    /**
     * 角色查询结果为空
     */
    E_120117(120117,"查询结果为空"),
    /**
     * 角色权限为空
     */
    E_120118(120118,"角色权限为空"),
    /**
     * 角色名称为空
     */
    E_120119(120119,"角色名称为空"),
    /**
     * 权限编码为空
     */
    E_120120(120120,"权限编码为空"),
    /**
     * 权限编码对应的权限为空
     */
    E_120121(120121,"权限编码对应的权限为空"),
    /**
     * 角色拥有者为空
     */
    E_120122(120122,"角色拥有者为空"),
    /**
     * 权限拥有者为空
     */
    E_120123(120123,"权限拥有者为空"),
    /**
     * 拥有的角色为空
     */
    E_120124(120124,"拥有的角色为空"),
    /**
     * 权限对应的权限组为空
     */
    E_120125(120125,"权限对应的权限组为空"),
    /**
     * 权限组id为空
     */
    E_120126(120126,"权限组id为空"),
    /**
     * 权限为空
     */
    E_120127(120127,"权限组为空"),
    /**
     * 请删除子权限组，再操作
     */
    E_120128(120128,"请删除子权限组，再操作"),
    /**
     * 请解绑或删除子权限，再操作
     */
    E_120129(120129,"请解绑或删除子权限，再操作"),
    /**
     * 请解绑权限角色关系，再操作
     */
    E_120130(120130,"请解绑权限角色关系，再操作"),
    /**
     * 请解绑拥有者和角色关系，再操作
     */
    E_120131(120131,"请解绑拥有者和角色关系，再操作"),
    /**
     * 此权限组没有权限
     */
    E_120132(120132,"此权限组没有权限"),
    /**
     * 权限组名称已存在
     */
    E_120133(120133,"权限组名称已存在"),
    /**
     * 权限名称已存在
     */
    E_120134(120134,"权限名称已存在"),
    /**
     * 角色编码已存在
     */
    E_120135(120135,"角色编码已存在"),
    /**
     * 新增数据失败（新增返回ID为null）
     */
    E_120136(120136,"新增数据失败（新增返回ID为null）"),
    /**
     * 权限组名称超过50字符
     */
    E_120137(120137,"权限组名称超过50字符"),
    /**
     * 权限名称超过50字符
     */
    E_120138(120138,"权限名称超过50字符"),
    /**
     * 权限编码超过50字符
     */
    E_120139(120139,"权限编码超过50字符"),
    /**
     * 角色名称超过50字符
     */
    E_120140(120140,"角色名称超过50字符"),
    /**
     * 角色编码超过50字符
     */
    E_120141(120141,"角色编码超过50字符"),
    /**
     * 权限编码不能为纯数字
     */
    E_120143(120143,"权限编码不能为纯数字"),
    /**
     * 角色编码只能由“字母、数字、中划线”组成
     */
    E_120144(120144,"角色编码只能由“字母、数字、中划线”组成"),
    /**
     * 角色编码对应的数据不存在
     */
    E_120145(120145,"角色编码对应的数据不存在"),
    /**
     * 角色拥有者编码超过50位
     */
    E_120146(120146,"角色拥有者编码超过50位"),
    /**
     * 角色拥有者编码只能由“字母、数字、中划线”组成
     */
    E_120147(120147,"角色拥有者编码只能由“字母、数字、中划线”组成"),
    /**
     * 权限拥有者拥有的角色为空
     */
    E_120148(120148,"权限拥有者拥有的角色为空"),
    /**
     * 权限拥有者与给定的角色无绑定关系
     */
    E_120149(120149,"权限拥有者与给定的角色无绑定关系"),
    
	////////////////////////////////////用户服务异常编码 //////////////////////////
	/**
	 * 用户名为空
	 */
	E_130101(130101,"用户名为空"),
	/**
	 * 密码为空
	 */
	E_130102(130102,"密码为空"),
	/**
	 * 用户不存在
	 */
	E_130103(130103,"用户不存在"),
	/**
	 * 用户名或密码错误
	 */
	E_130104(130104,"用户名或密码错误"),
	/**
	 * 手机号为空
	 */
	E_130105(130105,"手机号为空"),
	/**
	 * 认证码为空
	 */
	E_130106(130106,"认证码为空"),
	/**
	 * 租户类型为空
	 */
	E_130107(130107,"租户类型为空"),
	/**
	 * 租户ID为空
	 */
	E_130108(130108,"租户ID为空"),
	/**
	 * 应用编码为空
	 */
	E_130109(130109,"应用编码为空"),
	/**
	 * 租户类型编码为空
	 */
	E_130110(130110,"租户类型编码为空"),
	/**
	 * 租户名称为空
	 */
	E_130111(130111,"租户名称为空"),
	/**
	 * 租户内角色编码为空
	 */
	E_130112(130112,"租户内角色编码为空"),
	/**
	 * 旧密码为空
	 */
	E_130113(130113,"旧密码为空"),
	/**
	 * 新密码为空
	 */
	E_130114(130114,"新密码为空"),
	/**
	 * 账号已存在
	 */
	E_130115(130115,"账号已存在"),
	/**
	 * 密码错误
	 */
	E_130116(130116,"密码错误"),
	/**
	 * 新旧密码相同
	 */
	E_130117(130117,"新旧密码相同"),
	/**
	 * 认证码错误
	 */
	E_130118(130118,"认证码错误"),

    E_130119(130119,"请先解绑租户类型下角色，再操作"),

    E_130120(130120,"请先解绑租户下角色，再操作"),

    E_130121(130121,"请先解绑租户下账号，再操作"),

    E_130122(130122,"租户类型下有实体租户，操作失败"),

    E_130123(130123,"查询结果为空"),

    E_130124(130124,"删除失败，请先解除绑定关系"),

    E_130125(130125,"角色编码为空"),

    E_130126(130126,"租户类型编码已经存在"),

    E_130127(130127,"租户名称已经存在"),

    E_130128(130128,"编码对应的信息不存在"),

    E_130129(130129,"该租户类型编码不存在或租户类型内无角色"),

    E_130130(130130,"该租户类型内没有任何权限，所以无法创建无意义的租户"),

    E_130131(130131,"租户名称长度超过50"),

    E_130132(130132,"租户类型编码只能由“字母、数字、中划线”组成"),

    E_130133(130133,"租户类型编码长度超过50"),

    E_130134(130134,"账号只能由“字母、数字、中划线”组成"),

    E_130135(130135,"账号长度超过50"),

    E_130136(130136,"手机号码格式不正确"),

    E_130137(130137,"租户ID对应的租户不存在"),

    E_130138(130138,"角色编码对应的角色不存在"),

    E_130139(130139,"租户内角色为空"),

    E_130140(130140,"该租户下无此角色"),

    E_130141(130141,"操作失败，该手机号拥有多个账号"),

    E_130142(130142,"操作失败，租户类型名称长度超过50"),

	////////////////////////////////////特殊异常编码/////////////////////////////////////
    E_999991(999991,"调用微服务-授权服务 被熔断"),
    E_999992(999992,"调用微服务-用户服务 被熔断"),
    E_999993(999993,"调用微服务-资源服务 被熔断"),
    E_999994(999994,"调用微服务-同步服务 被熔断"),
	CUSTOM(999998,"自定义异常"),
	/**
	 * 未知错误
	 */
	UNKOWN(999999,"未知错误");






	private int code;
	private String desc;
		
	public int getCode() {
		return code;
	}

	public String getDesc() {
		return desc;
	}

	ErrorCode(int code, String desc) {
		this.code = code;
		this.desc = desc;
	}


	public static ErrorCode setErrorCode(int code) {
       for (ErrorCode errorCode : ErrorCode.values()) {
           if (errorCode.getCode()==code) {
               return errorCode;
           }
       }
	       return null;
	}
}
